### LONDON HOUSING DATASET ANALYSIS

In [2]:
import pandas as pd
import os
import plotly.express as ex
import plotly.graph_objects as go

pd.set_option("display.max_colwidth", None)
pd.set_option("display.max_columns", None)

In [3]:
df = pd.read_csv("C:\\GIT\\London-Housing\\data\\London Housing.csv")

In [4]:
df.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN

In [5]:
df.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [6]:
df.shape

(13549, 6)

In [9]:
# assuming that null for crime means no crime
# and null for house sold is no house sold
data=df.fillna(0)

In [10]:
data.isnull().sum()

date             0
area             0
average_price    0
code             0
houses_sold      0
no_of_crimes     0
dtype: int64

In [11]:
# we have new dataframe called data that has no null values in it
# from here we will use the new dataframe 'data' for our analysis

In [12]:
data.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,0.0
1,2/1/1995,city of london,82203,E09000001,7.0,0.0
2,3/1/1995,city of london,79121,E09000001,14.0,0.0
3,4/1/1995,city of london,77101,E09000001,7.0,0.0
4,5/1/1995,city of london,84409,E09000001,10.0,0.0

In [13]:
data['date'] = pd.to_datetime(data['date'])

In [14]:
data.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object